xmlбаза/Documents/Реализация_Товара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>Реализация_Товара</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВыполнениеЗаказов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ_клиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ_Клиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процент_наценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Закупочная_цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Итоговая_стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество_в_заказе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество_на_складе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Осталось_выдать</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выручка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уже_Выдано_Клиенту</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Закупочная_стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

xmlбаза/AccumulationRegisters/ВыполнениеЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>ВыполнениеЗаказов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ_Клиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияТоваровПоЗаказу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

xmlбаза/Enums/СостоянияТоваровПоЗаказу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>СостоянияТоваровПоЗаказу</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетЗакупки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСкладе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xmlбаза/Documents/Поступление_товара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>Поступление_товара</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВыполнениеЗаказов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ_клиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ_Клиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Информация_о_поставщике</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица_измерения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Единицы_Измерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Закупочная_цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Ставка_НДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склад</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

xmlбаза/Documents/Заказ_Клиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>Заказ_Клиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВыполнениеЗаказов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Характеристики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Клиент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

xmlбаза/Documents/Реализация_Товара/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьВсеПоСтроке(Стр, ПроцентНаценки)
	
	// долг
	Стр.Осталось_выдать = Стр.Количество_в_заказе - Стр.Уже_Выдано_Клиенту;
	// Рачет сколько потратили на закупку
	Стр.Закупочная_стоимость = Стр.Количество_на_складе * Стр.Закупочная_цена;	
	//Рассчит цены
	ЦенаПродажи = Стр.Закупочная_цена * (1 + ПроцентНаценки / 100); 
	
	//Итоговая стоимость
	Если Стр.Осталось_выдать <= 0 Тогда
		Стр.Итоговая_стоимость = Стр.Количество_в_заказе * ЦенаПродажи;
	Иначе
		Стр.Итоговая_стоимость = Стр.Уже_Выдано_Клиенту * ЦенаПродажи;
	КонецЕсли;
	
	//Выручка
	Стр.Выручка = Стр.Итоговая_стоимость - (Стр.Уже_Выдано_Клиенту * Стр.Закупочная_цена);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПоЗаказуНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Заказ_клиента) Тогда
		Возврат;
	КонецЕсли;

	Объект.Товары.Очистить();

	Запрос = Новый Запрос;
	
	Запрос.Текст = 	 
		"ВЫБРАТЬ
		|	Поступление_товараПоступление.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(Поступление_товараПоступление.Закупочная_цена) КАК Закупочная_цена
		|ПОМЕСТИТЬ ВТ_ЦеныПоступления
		|ИЗ
		|	Документ.Поступление_товара.Поступление КАК Поступление_товараПоступление
		|ГДЕ
		|	Поступление_товараПоступление.Ссылка.Заказ_клиента = &Заказ_клиента
		|
		|СГРУППИРОВАТЬ ПО
		|	Поступление_товараПоступление.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Заказ_КлиентаТовары.Номенклатура КАК Номенклатура,
		|	Заказ_КлиентаТовары.Количество КАК Количество_в_заказе,
		|	ЕСТЬNULL(ВыполнениеЗаказовОстатки.КоличествоОстаток, 0) КАК Количество_на_складе,
		|	ЕСТЬNULL(ВТ_ЦеныПоступления.Закупочная_цена, 0) КАК Закупочная_цена
		|ИЗ
		|	Документ.Заказ_Клиента.Товары КАК Заказ_КлиентаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныПоступления КАК ВТ_ЦеныПоступления
		|		ПО Заказ_КлиентаТовары.Номенклатура = ВТ_ЦеныПоступления.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыполнениеЗаказов.Остатки(
		|				, // Период пустой (запятая осталась) - берем текущие остатки
		|				ЗаказКлиента = &Заказ_клиента
		|					И Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТоваровПоЗаказу.НаСкладе)) КАК ВыполнениеЗаказовОстатки
		|		ПО Заказ_КлиентаТовары.Номенклатура = ВыполнениеЗаказовОстатки.Номенклатура
		|ГДЕ
		|	Заказ_КлиентаТовары.Ссылка = &Заказ_клиента";
					
	Запрос.УстановитьПараметр("Заказ_клиента", Объект.Заказ_клиента);
	Объект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Для Каждого Стр Из Объект.Товары Цикл
		
		Стр.Уже_Выдано_Клиенту = Мин(Стр.Количество_на_складе, Стр.Количество_в_заказе);
		
		РассчитатьВсеПоСтроке(Стр, Объект.Процент_наценки);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Заказ_клиентаПриИзменении(Элемент)
	ЗаполнитьТаблицуПоЗаказуНаСервере();
КонецПроцедуры           

&НаКлиенте
Процедура Процент_наценкиПриИзменении(Элемент)
		Для Каждого Стр Из Объект.Товары Цикл
		РассчитатьВсеПоСтроке(Стр, Объект.Процент_наценки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУже_Выдано_КлиентуПриИзменении(Элемент)
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		РассчитатьВсеПоСтроке(ТекущиеДанные, Объект.Процент_наценки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить_по_заказу(Команда)
	ЗаполнитьТаблицуПоЗаказуНаСервере();
КонецПроцедуры
